{"data":{"markdownRemark":{"html":"<h3>What is TCP</h3>\n<p>The transmission control protocol (TCP) is the internet standard ensuring the successful exchange of data packets between devices over a network. TCP is the underlying communication protocol for a wide variety of applications, including web servers and websites, email applications, FTP and peer-to-peer apps.</p>\n<p>TCP operates with the internet protocol (IP) to specify how data is exchanged online. IP is responsible for sending each packet to its destination, while TCP guarantees that bytes are transmitted in the order in which they were sent with no errors or omissions. Together, the two protocols are referred to as TCP/IP.</p>\n<h3>How it works</h3>\n<h4>TCP/IP is a two-layered program</h4>\n<p><strong>The higher layer (TCP)</strong> disassembles message content into small \"data packets\" that are then transmitted over the Internet to be re-assembled by the receiving computer's TCP back into the message's original form. <strong>The lower layer (IP)</strong> plays the role of \"address manager\" and gets each data packet to the correct destination. IP addresses are checked by every computer in a network to ensure messages are forwarded as needed.</p>\n<h4>TCP/IP runs on the client-server communication model</h4>\n<p> The user of a first computer (the client) makes a service request, such as forwarding a Web page, to a second network computer (the server). </p>\n<p> TCP/IP also relies on point-to-point communication, meaning that communications move from one host computer to another within a pre-defined network boundary.</p>\n<p> TCP/IP is said to be stateless because each request is new and unrelated to all previous requests.</p>\n<h3>The three-way handshake</h3>\n<p>TCP's three way handshaking technique is often referred to as \"SYN-SYN-ACK\", because <strong>there are three messages transmitted by TCP to negotiate and start a TCP session between two computers</strong>. </p>\n<p>The TCP handshaking mechanism is designed so that two computers attempting to communicate can negotiate the parameters of the network <strong>TCP socket</strong> connection before transmitting data such as SSH and HTTP web browser requests. And also designed so that both ends can initiate and negotiate separate TCP socket connections at the same time.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">TCP Sockets (or virtual ports) are used in TCP (and UDP) communication to identify unique end-to-end connections.\nThey are called &#39;virtual ports&#39; because a single physical connector can serve multiple connections. The port number and IP address together uniquely identify an endpoint. Together, two endpoints are considered a &#39;socket&#39;.</code></pre></div>\n<br>\n<h4>TCP 3-Way Handshake Diagram</h4>\n<p><strong>Diagram</strong></p>\n<p><img src=\"https://www.inetdaemon.com/img/internet/3-way-handshake.gif\" alt=\"TCP 3-way handshake diagram\"></p>\n<p><strong>Event</strong></p>\n<ul>\n<li>Host A sends a TCP <strong>SYN</strong>chronize packet to Host B</li>\n<li>Host B receives A's <strong>SYN</strong></li>\n<li>Host B sends a <strong>SYN</strong>chronize-<strong>ACK</strong>nowledgement</li>\n<li>Host A receives B's <strong>SYN-ACK</strong></li>\n<li>Host A sends <strong>ACK</strong>nowledge</li>\n<li>Host B receives <strong>ACK</strong>. </li>\n<li>TCP socket connection is <strong>ESTABLISHED</strong>.</li>\n</ul>\n<p><strong>TCP knows whether the network TCP socket connection is opening, synchronizing, established by using the SYNchronize and ACKnowledge messages</strong> when establishing a network TCP socket connection.</p>\n<h3>TCP/IP and Higher-Level Applications</h3>\n<p>Many higher-level apps constitute a higher layer of protocol language are often packaged along with TCP/IP. e.g. <code class=\"language-text\">HTTP、FTP、Telnet、SMTP</code>.</p>\n<h3>TCP DDoS vulnerabilities and methods of mitigation</h3>\n<p>TCP is vulnerable to several types of DDoS attacks, including: <code class=\"language-text\">SYN flood、STOMP DDoS attack、TCP fragmentation (Teardrop)</code>.</p>\n<h4>SYN flood</h4>\n<p>SYN floods occur during the initial stage of a three-way handshake by sending TCP connection requests (SYN packets) to every port on a target machine faster than it can process the requests.</p>\n<p><img src=\"https://www.imperva.com/learn/wp-content/uploads/sites/13/2019/01/syn-flood.jpg\" alt=\"SYN flood\"></p>\n<p>There are several ways to mitigate SYN floods, including:</p>\n<ol>\n<li><strong>Micro-blocks</strong> – The server allocates a micro-record in its memory for each SYN request instead of a complete connection object.</li>\n<li><strong>SYN cookies</strong> - The server uses cryptographic hashing to verify a TCP request before allocating memory.</li>\n<li><strong>RST cookies</strong> – The server intentionally sends an incorrect response after the initial SYN request. If the client is legitimate, the server receives an RST packet, telling the server something is wrong.</li>\n<li><strong>TCP stack tweaking</strong> – You can decrease the timeout for releasing memory allocated to a connection.</li>\n</ol>\n<h4>STOMP DDoS attack</h4>\n<p>STOMP is a text-based protocol that allows applications to communicate with message brokers using TCP. In a STOMP DDoS attack, perpetrators use a botnet to open large numbers of TCP handshakes with applications. The attackers then send junk data disguised as STOMP TCP requests, saturating the network. If the server is prepared to parse STOMP requests, the attack can also exhaust server resources.</p>\n<h4>TCP fragmentation</h4>\n<p>A teardrop attack is a type of IP fragmentation attack that targets the TCP/IP reassembly mechanism, occurring after a three-way handshake has been completed and data is being transmitted. It involves an attacker deliberately sending data packets with defective segment offset fields, preventing the receiver from correctly putting together the fragmented data. Data packets overlap and quickly overwhelm the victim’s servers.</p>\n<p>Preventing TCP fragmentation attacks requires the inspection of incoming packets using routers, secure proxies or a cloud-based DDoS protection service. Packets with incorrect fragmentation are then detected and dropped before they reach your serve.</p>\n<h3>Refers</h3>\n<p><a href=\"https://www.inetdaemon.com/tutorials/internet/tcp/3-way_handshake.shtml\">TCP 3-Way Handshake (SYN,SYN-ACK,ACK)</a></p>","frontmatter":{"date":"May 20, 2019","path":"tcp","category":"frontend","title":"Transmission Control Protocol"}}},"pageContext":{"location":"tcp","category":"frontend"}}