{"data":{"markdownRemark":{"html":"<h3>What is TCP</h3>\n<p>The transmission control protocol (TCP) is the internet standard ensuring the successful exchange of data packets between devices over a network. TCP is the underlying communication protocol for a wide variety of applications, including web servers and websites, email applications, FTP and peer-to-peer apps.</p>\n<p>TCP operates with the internet protocol (IP) to specify how data is exchanged online. IP is responsible for sending each packet to its destination, while TCP guarantees that bytes are transmitted in the order in which they were sent with no errors or omissions. Together, the two protocols are referred to as TCP/IP.</p>\n<h3>How it works</h3>\n<h4>TCP/IP is a two-layered program</h4>\n<p><strong>The higher layer (TCP)</strong> disassembles message content into small \"data packets\" that are then transmitted over the Internet to be re-assembled by the receiving computer's TCP back into the message's original form. <strong>The lower layer (IP)</strong> plays the role of \"address manager\" and gets each data packet to the correct destination. IP addresses are checked by every computer in a network to ensure messages are forwarded as needed.</p>\n<h4>TCP/IP runs on the client-server communication model</h4>\n<p> The user of a first computer (the client) makes a service request, such as forwarding a Web page, to a second network computer (the server). </p>\n<p> TCP/IP also relies on point-to-point communication, meaning that communications move from one host computer to another within a pre-defined network boundary.</p>\n<p> TCP/IP is said to be stateless because each request is new and unrelated to all previous requests.</p>\n<h3>The three-way handshake</h3>\n<p>Establishing a TCP connection requires that both the client and server participate in what is known as a three-way handshake. The process can be broken down as follows:</p>\n<ol>\n<li>A client sends the server a SYN packet—a connection request from its source port to a server’s destination port.</li>\n<li>The server responds with a SYN/ACK packet, acknowledging the receipt of the connection request.</li>\n<li>The client receives the SYN/ACK packet and responds with an ACK packet of its own.</li>\n</ol>\n<h3>TCP/IP and Higher-Level Applications</h3>\n<p>Many higher-level apps constitute a higher layer of protocol language are often packaged along with TCP/IP. e.g. <code class=\"language-text\">HTTP、FTP、Telnet、SMTP</code>.</p>","frontmatter":{"date":"May 20, 2019","path":"tcp","category":"frontend","title":"Transmission Control Protocol"}}},"pageContext":{"location":"tcp","category":"frontend"}}