{"data":{"markdownRemark":{"html":"<h2>What is CSRF</h2>\n<p>Cross-Site Request Forgery (CSRF) is a type of attack that occurs when a malicious web site, email, blog, instant message, or program causes <strong>a user’s web browser to perform an unwanted action on a trusted site when the user is authenticated</strong>. </p>\n<p>A CSRF attack works because browser requests automatically include any credentials associated with the site, such as the user's session cookie, IP address, etc. Therefore, if the user is authenticated to the site, the site cannot distinguish between the forged or legitimate request sent by the victim. We would need a <code class=\"language-text\">token/identifier</code> that is not accessible to attacker and would not be sent along with forged requests that attacker initiates.</p>\n<p>The impact of a successful CSRF attack is limited to the capabilities exposed by the vulnerable application. For example, this attack could result in a transfer of funds, changing a password, or making a purchase with the user’s credentials.</p>\n<p>Using social engineering, an attacker can embed malicious HTML or JavaScript code into an email or website to request a specific 'task URL'. The task then executes with or without the user's knowledge, either directly or by using a Cross-Site Scripting flaw.</p>\n<h3>CSRF example</h3>\n<p>For example, a typical GET request for a $100 bank transfer might look like:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">GET http://netbank.com/transfer.do?acct=PersonB&amp;amount=$100 HTTP/1.1</code></pre></div>\n<p>A hacker can modify this script so it results in a $100 transfer to their own account. Now the malicious request might look like:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">GET http://netbank.com/transfer.do?acct=AttackerA&amp;amount=$100 HTTP/1.1</code></pre></div>\n<p>A bad actor can embed the request into an innocent looking hyperlink:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">&lt;a href=&quot;http://netbank.com/transfer.do?acct=AttackerA&amp;amount=$100&quot;&gt;Read more!&lt;/a&gt;</code></pre></div>\n<p>Next, he can distribute the hyperlink via email to a large number of bank customers. Those who click on the link while logged into their bank account will unintentionally initiate the $100 transfer.</p>\n<p>If the bank’s website is only using POST requests, it’s impossible to frame malicious requests using a <code class=\"language-text\">&lt;a&gt;</code> href tag. However, the attack could be delivered in a <code class=\"language-text\">&lt;form&gt;</code> tag with automatic execution of the embedded JavaScript.</p>\n<div class=\"gatsby-highlight\" data-language=\"html\"><pre class=\"language-html\"><code class=\"language-html\"> <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>body</span> <span class=\"token attr-name\">onload</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>document.forms[0].submit()<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span>\n   <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>form</span> <span class=\"token attr-name\">action</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>http://netbank.com/transfer.do<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">method</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>POST<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span>\n     <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>input</span> <span class=\"token attr-name\">type</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>hidden<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">name</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>acct<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">value</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>AttackerA<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">/></span></span>\n     <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>input</span> <span class=\"token attr-name\">type</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>hidden<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">name</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>amount<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">value</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>$100<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">/></span></span>\n     <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>input</span> <span class=\"token attr-name\">type</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>submit<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">value</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>View my pictures!<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">/></span></span>\n   <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>form</span><span class=\"token punctuation\">></span></span>\n <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>body</span><span class=\"token punctuation\">></span></span></code></pre></div>\n<p>CSRFs are typically conducted using malicious social engineering, such as an email or link that tricks the victim into sending a forged request to a server. As the unsuspecting user is authenticated by their application at the time of the attack, it’s impossible to distinguish a legitimate request from a forged one.</p>\n<p><img src=\"https://www.imperva.com/learn/wp-content/uploads/sites/13/2019/01/csrf-cross-site-request-forgery.png\" alt=\"CSRF\"></p>\n<h3>Limitations</h3>\n<p>The attack is blind: the attacker cannot see what the target website sends back to the victim in response to the forged requests, unless they exploit a cross-site scripting or other bug at the target website.</p>\n<ul>\n<li>The attacker must target either a site that doesn't check the referrer header or a victim with a browser or plugin that allows referer spoofing.[citation needed]</li>\n<li>The attacker must find a form submission at the target site, or a URL that has side effects, that does something (e.g., transfers money, or changes the victim's e-mail address or password).</li>\n<li>The attacker must determine the right values for all the forms or URL inputs; if any of them are required to be secret authentication values or IDs that the attacker can't guess, the attack will most likely fail (unless the attacker is extremely lucky in their guess).</li>\n<li>The attacker must lure the victim to a web page with malicious code while the victim is logged into the target site.</li>\n</ul>\n<h2>Primary defense technique</h2>\n<h3>Token based mitigation</h3>\n<h4>Synchronizer Token Pattern</h4>\n<p>Any state changing operation requires a secure random token to prevent CSRF attacks. The CSRF token is added as a hidden field for forms, headers/parameters for AJAX calls (and within the URL if the state changing operation occurs via a GET). The server will rejects the requested action if the CSRF token fails validation.</p>\n<p><strong>Inserting the CSRF token in the HTTP request header</strong> via JavaScript is considered more secure than adding the token in the hidden field form parameter. In this situation, even if the CSRF token is weak, predictable or leaked but still an attacker cannot forge the POST request directly by setting the custom request header through XMLHttpRequest. When the attacker tries to set any custom header through any XMLHttpRequest, the browser sends the <strong>OPTIONS (pre-flight) request</strong>, the browser prevents the forged request to be sent.</p>\n<p>When a Web application formulates a request, the application should include a hidden input parameter with a common name such as \"CSRFToken\" (for forms) as header/parameter value for Ajax calls. The value of this token must be randomly generated such that it cannot be guessed by an attacker. Consider leveraging the <code class=\"language-text\">java.security.SecureRandom</code> class for Java applications to generate a sufficiently long random token. Alternative generation algorithms include the use of <code class=\"language-text\">256-bit BASE64</code> encoded hashes. </p>\n<div class=\"gatsby-highlight\" data-language=\"html\"><pre class=\"language-html\"><code class=\"language-html\"><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>form</span> <span class=\"token attr-name\">action</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>/transfer.do<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">method</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>post<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span>\n\n<span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>input</span> <span class=\"token attr-name\">type</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>hidden<span class=\"token punctuation\">\"</span></span> <span class=\"token attr-name\">name</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>CSRFToken<span class=\"token punctuation\">\"</span></span>\n<span class=\"token attr-name\">value</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>OWY4NmQwODE4ODRjN2Q2NTlhMmZlYWEwYzU1YWQwMTVhM2JmNGYxYjJiMGI4MjJjZDE1ZDZMGYwMGEwOA==<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span>\n<span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>form</span><span class=\"token punctuation\">></span></span></code></pre></div>\n<br>\n<h5>Disclosure of Token in URL</h5>\n<p>Some implementations of synchronizer tokens include the challenge token in GET (URL) requests as well as POST requests. While this control does help mitigate the risk of CSRF attacks, the unique per-session token is being exposed for GET requests. CSRF tokens in GET requests are potentially leaked at several locations: </p>\n<ul>\n<li>browser history</li>\n<li>log files</li>\n<li>network appliances that make a point to log the first line of an HTTP request</li>\n<li>referer headers if the protected site links to an external site.</li>\n</ul>\n<p>The ideal solution is to only include the CSRF token in POST requests and modify server-side actions that have state changing affect to only respond to POST requests.</p>\n<h4>Encryption based Token Pattern</h4>\n<p>The Encrypted Token Pattern leverages an encryption, rather than comparison method of Token-validation. It is most suitable for applications that do not want to maintain any state at server side.</p>\n<p>Server generates a token comprised of the user's session ID and a timestamp (to prevent replay attacks) using a unique key available only on the server. This token is returned to the client and embedded in a hidden field for forms, in the request-header/parameter for AJAX requests. On receipt of this request, the server reads and decrypts the token value with the same key used to create the token.  Once decrypted, If session-id matches and the timestamp is under the defined token expiry time, request can be allowed.</p>\n<h4>HMAC Based Token Pattern</h4>\n<p>HMAC Based Token Pattern mitigation is also achieved without maintaining any state at the server. HMAC based CSRF protection works similar to encryption based CSRF protection with a couple of minor differences:</p>\n<ul>\n<li>Use strong HMAC function (SHA256 or stronger algorithms are recommended) instead of an encryption function to generate the token</li>\n<li>Token is HMAC+timestamp</li>\n</ul>\n<h3>Auto CSRF Mitigation Techniques</h3>\n<p>Though the technique of mitigating tokens is widely used (stateful with synchronizer token and stateless with encrypted/HMAC token), the major problem associated with these techniques is the human tendency to forget things at times.</p>\n<p>To avoid this, you can try to automate the process of adding tokens to CSRF vulnerable resources:</p>\n<ul>\n<li>write wrappers</li>\n<li>write a hook</li>\n<li>use client side script</li>\n<li>in-build framework</li>\n</ul>\n<h3>Defense In Depth Techniques</h3>\n<h4>Verifying origin with standard headers</h4>\n<p>At server side we verify if source origin and target origin match, we accept the request as legitimate and if they don’t, we discard the request.</p>\n<h5>Identifying Source Origin</h5>\n<ul>\n<li>If the Origin header is present, verify that its value matches the target origin.</li>\n<li>If the Origin header is not present, verify the hostname in the Referer header matches the target origin.</li>\n<li>If neither of these headers are present, you can either accept or block the request.</li>\n</ul>\n<p>In both cases, the target origin check is strong. For example, if your site is site.com make sure site.com.attacker.com does not pass your origin check.</p>\n<h5>Identifying the Target Origin</h5>\n<p>If you are behind a proxy, there are a number of options to consider.</p>\n<ul>\n<li>Configure your application to simply know its target origin.</li>\n<li>Use the Host header value.</li>\n<li>Use the X-Forwarded-Host header value.</li>\n</ul>\n<h4>Double Submit Cookie</h4>\n<p>If maintaining the state for CSRF token at server side is problematic, an alternative defense is to use the double submit cookie technique. This technique is easy to implement and is stateless. In this technique.</p>\n<p>We send a random value in both a cookie and as a request parameter, with the server verifying if the cookie value and request value match. When a user visits the site should generate a pseudorandom value and <strong>set it as a cookie on the user's machine</strong> separate from the session identifier. The site then requires that every transaction request include this pseudorandom value as a hidden form value. If both of them match at server side, the server accepts it as legitimate request and if they don’t, it would reject the request.</p>\n<p>There’s a belief that this technique would work because a cross origin attacker cannot read any data sent from the server or modify cookie values.</p>\n<p>There are a couple of drawbacks associated with the assumptions made here. The problem of \"trusting of sub domains and proper configuration of whole site in general to accept HTTPS connections only\".</p>\n<h4>Samesite Cookie Attribute</h4>\n<p>SameSite is a cookie attribute (similar to HTTPOnly, Secure etc.) introduced by Google to mitigate CSRF attacks. This attribute helps in preventing the browser from sending cookies along with cross-site requests, possible values are lax or strict.</p>\n<p>The strict value will prevent the cookie from being sent by the browser to the target site in all cross-site browsing context, even when following a regular link.</p>\n<p>For example, for a GitHub-like website, if a logged-in user follows a link to a private GitHub project posted on a corporate discussion forum or email, GitHub will not receive the session cookie and the user will not be able to access the project.</p>\n<p>Though this technique seems to be efficient in mitigating CSRF attacks, it is still in early stages (in draft) and does not have full browser support as mentioned above.</p>\n<p>Considering the factors above, it is not recommended to be used as a primary defense. Google agrees with this stance and strongly encourages developers to deploy server-side defenses such as tokens to mitigate CSRF more fully.</p>\n<h4>Use of Custom Request Headers</h4>\n<p>An alternate defense that is particularly well suited for AJAX/XHR endpoints is the use of a custom request header. This defense relies on the <code class=\"language-text\">same-origin policy</code> (SOP) restriction that only JavaScript can be used to add a custom header, and only within its origin. By default, browsers do not allow JavaScript to make cross origin requests.</p>\n<h4>User Interaction Based CSRF Defense</h4>\n<p>It’s easier or more appropriate to involve the user in the transaction to prevent unauthorized operations:</p>\n<ul>\n<li>Re-Authentication (password or stronger)</li>\n<li>One-time Token</li>\n<li>CAPTCHA</li>\n</ul>\n<p>For applications that are in need of high security for some operations. Please note that tokens by themselves can mitigate CSRF, developers should use these techniques only to achieve additional security for their high sensitive operations.</p>\n<h3>Not So Popular CSRF Mitigations</h3>\n<ul>\n<li>Triple Submit Cookie</li>\n<li>Content-Type Header Validation</li>\n</ul>\n<h2>Resources</h2>\n<p><a href=\"https://github.com/OWASP/CheatSheetSeries/blob/master/cheatsheets/Cross-Site_Request_Forgery_Prevention_Cheat_Sheet.md\">OWASP</a></p>\n<p><a href=\"https://www.acunetix.com/websitesecurity/csrf-attacks/\">CSRF Attacks: Anatomy, Prevention, and XSRF Tokens</a> - acunetix</p>\n<p><a href=\"https://www.imperva.com/learn/application-security/csrf-cross-site-request-forgery/\">Cross site request forgery (CSRF) attack</a> - imperva</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Cross-site_request_forgery\">Cross-site request forgery</a> - wikipedia</p>","frontmatter":{"date":"July 08, 2019","path":"csrf","category":"frontend","title":"CSRF"}}},"pageContext":{"location":"csrf","category":"frontend"}}