{"data":{"markdownRemark":{"html":"<p>Most HTTP responses include an entity which contains information for interpretation by a human user. Naturally, it is desirable to supply the user with the \"best available\" entity corresponding to the request. Unfortunately for servers and caches, not all users have the same preferences for what is \"best,\" and not all user agents are equally capable of rendering all entity types. For that reason, HTTP has provisions for several mechanisms for \"content negotiation\".</p>\n<p>There are two kinds of content negotiation which are possible in HTTP: <strong>server-driven</strong> and <strong>agent-driven negotiation</strong>. These two kinds of negotiation are orthogonal and thus may be used separately or in combination. </p>\n<h3>Server-driven Negotiation</h3>\n<p>If the selection of the best representation for a response is made by an algorithm located at the server, it is called server-driven negotiation.</p>\n<p>HTTP/1.1 includes the following request-header fields for enabling server-driven negotiation through description of user agent capabilities and user preferences: <code class=\"language-text\">Accept</code>, <code class=\"language-text\">Accept-Charset</code>, <code class=\"language-text\">Accept-Encoding</code>, <code class=\"language-text\">Accept-Language</code>, and <code class=\"language-text\">User-Agent</code>.</p>\n<h3>Agent-driven Negotiation</h3>\n<p>HTTP/1.1 defines the <code class=\"language-text\">300</code> and <code class=\"language-text\">406</code> status codes for enabling agent-driven negotiation when the server is unwilling or unable to provide a varying response using server-driven negotiation.</p>\n<h3>Defining content format</h3>\n<p>When you put data in the payload of a HTTP message within a request or a response, you must specify the corresponding format using a Content-Type.</p>\n<p>It is mandatory to allow the client or the server to know the format and make it possible to handle data. Here is a sample use of the header within a HTTP request:</p>\n<div class=\"gatsby-highlight\" data-language=\"readme\"><pre class=\"language-readme\"><code class=\"language-readme\">POST /contacts HTTP/1.1\nContent-Type: application/json\n\n{\n  &quot;lastName&quot;: &quot;Fielding&quot;,\n  &quot;firstName&quot;: &quot;Roy&quot;\n}\n\nHTTP/1.1 201 OK\nLocation: http://myrestservice/contacts/1</code></pre></div>","frontmatter":{"date":"July 01, 2019","path":"xss","category":"frontend","title":"XSS"}}},"pageContext":{"location":"xss","category":"frontend"}}