{"data":{"markdownRemark":{"html":"<h3>Overview</h3>\n<h4>What is XSS</h4>\n<p>Cross-site scripting (XSS) is a code injection attack that allows an attacker to execute malicious JavaScript in another user's browser.</p>\n<p>The attacker exploits a vulnerability in a website, in order to get the website to deliver the malicious JavaScript for the victim to visit.</p>\n<h4>How the malicious JavaScript is injected</h4>\n<p>In the example below, a simple server-side script is used to display the latest comment on a website:</p>\n<div class=\"gatsby-highlight\" data-language=\"javascript\"><pre class=\"language-javascript\"><code class=\"language-javascript\">print <span class=\"token string\">\"&lt;html>\"</span>\nprint <span class=\"token string\">\"Latest comment:\"</span>\nprint database<span class=\"token punctuation\">.</span>latestComment\nprint <span class=\"token string\">\"&lt;/html>\"</span></code></pre></div>\n<p>Since the user input is included directly, an attacker could submit this comment: \"<script>...</script>\". Any user visiting the page would now receive the following response:</p>\n<div class=\"gatsby-highlight\" data-language=\"javascript\"><pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token operator\">&lt;</span>html<span class=\"token operator\">></span>\nLatest comment<span class=\"token punctuation\">:</span>\n<span class=\"token operator\">&lt;</span>script<span class=\"token operator\">></span><span class=\"token operator\">...</span><span class=\"token operator\">&lt;</span><span class=\"token operator\">/</span>script<span class=\"token operator\">></span>\n<span class=\"token operator\">&lt;</span><span class=\"token operator\">/</span>html<span class=\"token operator\">></span></code></pre></div>\n<p>When the user's browser loads the page, it will execute whatever JavaScript code is contained inside the <code class=\"language-text\">&lt;script&gt;</code> tags. The attacker has now succeeded with his attack.</p>\n<h4>What is malicious JavaScript?</h4>\n<p>JavaScript runs in a very restricted environment that has extremely limited access to the user's files and operating system. It would be very unlikely to cause any damage to your computer.</p>\n<p>However, the possibility of JavaScript being malicious becomes more clear when you consider the following facts:</p>\n<ul>\n<li>JavaScript has access to some of the user's sensitive information, such as cookies.</li>\n<li>JavaScript can send HTTP requests with arbitrary content to arbitrary destinations by using XMLHttpRequest and other mechanisms.</li>\n<li>JavaScript can make arbitrary modifications to the HTML of the current page by using DOM manipulation methods.</li>\n</ul>\n<h4>The consequences of malicious JavaScript</h4>\n<p><strong>Cookie theft</strong></p>\n<p>  The attacker can access the victim's cookies associated with the website using <code class=\"language-text\">document.cookie</code>, send them to his own server, and use them to extract sensitive information like session IDs.</p>\n<p><strong>Keylogging</strong></p>\n<p>  The attacker can register a keyboard event listener using <code class=\"language-text\">addEventListener</code> and then send all of the user's keystrokes to his own server, potentially recording sensitive information such as passwords and credit card numbers.</p>\n<p><strong>Phishing</strong></p>\n<p>  The attacker can insert a fake login form into the page using DOM manipulation, set the form's action attribute to target his own server, and then trick the user into submitting sensitive information.</p>\n<h3>XSS Attacks</h3>\n<h4>How attack works</h4>\n<p><img src=\"https://excess-xss.com/persistent-xss.png\"></p>\n<h4>Types of XSS</h4>\n<ul>\n<li>Persistent XSS, where the malicious string originates from the website's database.</li>\n<li>Reflected XSS, where the malicious string originates from the victim's request.</li>\n<li>DOM-based XSS, where the vulnerability is in the client-side code rather than the server-side code.</li>\n</ul>\n<h4>Reflected XSS</h4>\n<p>In a reflected XSS attack, the malicious string is part of the victim's request to the website.</p>\n<p><img src=\"https://excess-xss.com/reflected-xss.png\"></p>\n<p><strong>How can reflected XSS succeed?</strong></p>\n<p>At first, reflected XSS might seem harmless because it requires the victim himself to actually send a request containing a malicious string. As it turns out, there are at least two common ways of causing a victim to launch a reflected XSS attack against himself:</p>\n<ol>\n<li>If the user targets a specific individual, the attacker can send the malicious URL to the victim (using e-mail or instant messaging, for example) and trick him into visiting it.</li>\n<li>If the user targets a large group of people, the attacker can publish a link to the malicious URL (on his own website or on a social network, for example) and wait for visitors to click it.</li>\n</ol>\n<h4>DOM-based XSS</h4>\n<p><img src=\"https://excess-xss.com/dom-based-xss.png\"></p>\n<p><strong>What makes DOM-based XSS different</strong></p>\n<ul>\n<li>In traditional XSS, the malicious JavaScript is executed when the page is loaded, as part of the HTML sent by the server.</li>\n<li>In DOM-based XSS, the malicious JavaScript is executed at some point after the page has loaded, as a result of the page's legitimate JavaScript treating user input in an unsafe way.</li>\n</ul>\n<h3>Preventing XSS</h3>\n<p>Recall that an XSS attack is a type of code injection, In order to prevent this type of code injection, secure input handling is needed. For a web developer, there are two fundamentally different ways of performing secure input handling.</p>\n<ul>\n<li><strong>Encoding</strong>, which escapes the user input so that the browser interprets it only as data, not as code.</li>\n<li><strong>Validation</strong>, which filters the user input so that the browser interprets it as code without malicious commands.</li>\n</ul>\n<h4>Input handling contexts</h4>\n<table>\n<thead>\n<tr>\n<th align=\"center\"></th>\n<th align=\"center\"></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"center\">Application code</td>\n<td align=\"center\"><code class=\"language-text\">&lt;input value=&quot;userInput&quot;&gt;</code></td>\n</tr>\n<tr>\n<td align=\"center\">Malicious string</td>\n<td align=\"center\"><code class=\"language-text\">&quot;&gt;&lt;script&gt;...&lt;/script&gt;&lt;input value=&quot;</code></td>\n</tr>\n<tr>\n<td align=\"center\">Resulting code</td>\n<td align=\"center\"><code class=\"language-text\">&lt;input value=&quot;&quot;&gt;&lt;script&gt;...&lt;/script&gt;&lt;input value=&quot;&quot;&gt;</code></td>\n</tr>\n</tbody>\n</table>\n<p>If the same input were inserted into another context, the closing delimiter would be different and injection would become possible. For this reason, secure input handling always needs to be tailored to the context where the user input will be inserted.</p>\n<h4>Inbound/outbound input handling</h4>\n<p>There is no easy way of determining when user input arrives which context it will eventually be inserted into, Relying on inbound input handling to prevent XSS is thus a very brittle solution that will be prone to errors.\nInstead, outbound input handling should be your primary line of defense against XSS, because it can take into account the specific context that user input will be inserted into.</p>\n<p>In most modern web applications, user input is handled by both server-side code and client-side code. In order to protect against all types of XSS, secure input handling must be performed in both the server-side code and the client-side code.</p>\n<h4>Encoding</h4>\n<p>Encoding is the act of escaping user input so that the browser interprets it only as data, not as code.</p>\n<p><strong>Limitations of encoding</strong></p>\n<p>Even with encoding, it will be possible to input malicious strings into some contexts.</p>\n<div class=\"gatsby-highlight\" data-language=\"javascript\"><pre class=\"language-javascript\"><code class=\"language-javascript\">document<span class=\"token punctuation\">.</span><span class=\"token function\">querySelector</span><span class=\"token punctuation\">(</span><span class=\"token string\">'a'</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">.</span>href <span class=\"token operator\">=</span> userInput</code></pre></div>\n<p>This in itself does not prevent the attacker from inserting a URL beginning with \"javascript:\". When the link is clicked, whatever JavaScript is embedded inside the URL will be executed.</p>\n<h4>Validation</h4>\n<p>Validation is the act of filtering user input so that all malicious parts of it are removed, without necessarily removing all code in it. One of the most recognizable types of validation in web development is <strong>allowing</strong> some HTML elements (such as <code class=\"language-text\">&lt;em&gt;</code> and <code class=\"language-text\">&lt;strong&gt;</code>) but <strong>disallowing</strong> others (such as <code class=\"language-text\">&lt;script&gt;</code>).</p>\n<p>There are two main characteristics of validation that differ between implementations:</p>\n<ul>\n<li>Classification strategy</li>\n<li>Validation outcome</li>\n</ul>\n<h5>Classification strategy</h5>\n<p><strong>Blacklisting</strong></p>\n<p>If a string matches this pattern, it is then marked as invalid.</p>\n<p>However, blacklisting has two major drawbacks:</p>\n<ul>\n<li>\n<p><strong>Complexity</strong></p>\n<p>Accurately describing the set of all possible malicious strings is usually a very complex task. </p>\n</li>\n<li>\n<p><strong>Staleness</strong></p>\n<p>Even if a perfect blacklist were developed, it would fail if a new feature allowing malicious use were added to the browser. </p>\n</li>\n</ul>\n<p><strong>Whitelisting</strong></p>\n<p>Whitelisting is essentially the opposite of blacklisting: instead of defining a forbidden pattern, a whitelist approach defines an allowed pattern and marks input as invalid if it does not match this pattern.</p>\n<p>Compared to blacklisting, there are two major benefits of whitelisting:</p>\n<ul>\n<li>\n<p><strong>Simplicity</strong></p>\n<p>Accurately describing a set of safe strings is generally much easier than identifying the set of all malicious strings.</p>\n</li>\n<li>\n<p><strong>Longevity</strong></p>\n<p>Unlike a blacklist, a whitelist will generally not become obsolete when a new feature is added to the browser.</p>\n</li>\n</ul>\n<h5>Validation outcome</h5>\n<p>When input has been marked as invalid, one of two actions can be taken:</p>\n<ul>\n<li>\n<p>Rejection\nThe input is simply rejected</p>\n</li>\n<li>\n<p>Sanitisation\nAll invalid parts of the input are removed, and the remaining input is used normally by the website.</p>\n</li>\n</ul>\n<h3>Which prevention technique to use</h3>\n<p><strong>Encoding</strong> should be your first line of defense against XSS</p>\n<p>As a second line of defense, you should use <strong>inbound validation</strong> to sanitize or reject data</p>\n<p>As a third line of defense, you should also make use of <strong>Content Security Policy</strong> (CSP)</p>\n<h3>Content Security Policy (CSP)</h3>\n<p>CSP is used to constrain the browser viewing your page so that it can only use resources downloaded from trusted sources. </p>\n<p>CSP can be used to enforce the following rules:</p>\n<ul>\n<li>\n<p><strong>No untrusted sources</strong></p>\n<p>External resources can only be loaded from a set of clearly defined trusted sources.</p>\n</li>\n<li>\n<p><strong>No inline resources</strong></p>\n<p>Inline JavaScript and CSS will not be evaluated.</p>\n</li>\n<li>\n<p><strong>No eval</strong></p>\n<p>The JavaScript eval function cannot be used.</p>\n</li>\n</ul>\n<h4>How to enable CSP</h4>\n<p>By default, browsers do not enforce CSP. To enable CSP on your website, pages must be served with an additional HTTP header: <code class=\"language-text\">Content‑Security‑Policy</code>.</p>\n<h4>An example policy</h4>\n<div class=\"gatsby-highlight\" data-language=\"html\"><pre class=\"language-html\"><code class=\"language-html\">Content‑Security‑Policy:\n    script‑src 'self' scripts.example.com;\n    media‑src 'none';\n    img‑src *;\n    default‑src 'self' http://*.example.com</code></pre></div>\n<ul>\n<li>Scripts can be downloaded only from the host serving the page and from <code class=\"language-text\">scripts.example.com</code>.</li>\n<li>Audio and video files cannot be downloaded from anywhere.</li>\n<li>Image files can be downloaded from any host.</li>\n<li>All other resources can be downloaded only from the host serving the page and from any subdomain of <code class=\"language-text\">example.com</code>.</li>\n</ul>\n<h4>Status of CSP</h4>\n<p>As of June 2013, Content Security Policy is a W3C candidate recommendation. It is being implemented by browser vendors, but parts of it are still browser-specific.</p>\n<h3>Summary</h3>\n<h4>Overview of XSS</h4>\n<ul>\n<li>XSS is a code injection attack made possible through insecure handling of user input.</li>\n<li>A successful XSS attack allows an attacker to execute malicious JavaScript in a victim's browser.</li>\n<li>A successful XSS attack compromises the security of both the website and its users.</li>\n</ul>\n<h4>XSS Attacks</h4>\n<ul>\n<li>\n<p>There are three major types of XSS attacks:</p>\n<ul>\n<li><strong>Persistent XSS</strong>, where the malicious input originates from the website's database.</li>\n<li><strong>Reflected XSS</strong>, where the malicious input originates from the victim's request.</li>\n<li><strong>DOM-based XSS</strong>, where the vulnerability is in the client-side code rather than the server-side code.</li>\n</ul>\n</li>\n<li>All of these attacks are performed in different ways but have the same effect if they succeed.</li>\n</ul>\n<h4>Preventing XSS</h4>\n<ul>\n<li>\n<p>The most important way of preventing XSS attacks is to perform secure input handling.</p>\n<ul>\n<li>Most of the time, encoding should be performed whenever user input is included in a page.</li>\n<li>In some cases, encoding has to be replaced by or complemented with validation.</li>\n<li>Secure input handling has to take into account which context of a page the user input is inserted into.</li>\n<li>To prevent all types of XSS attacks, secure input handling has to be performed in both client-side and server-side code.</li>\n</ul>\n</li>\n<li>Content Security Policy provides an additional layer of defense for when secure input handling fails.</li>\n</ul>","frontmatter":{"date":"June 22, 2019","path":"xss","category":"frontend","title":"XSS"}}},"pageContext":{"location":"xss","category":"frontend"}}