{"data":{"markdownRemark":{"html":"<p>One of the central tenets of REST is that a given object can have multiple representations.  For human consumption, an object might be rendered as HTML, PDF, video, etc.  For machine consumption, an object might be rendered as XML or JSON.  Indeed, within those broad categories, an object might have many different representations.</p>\n<p>There are two kinds of content negotiation which are possible in HTTP: <strong>server-driven</strong> and <strong>agent-driven negotiation</strong>. These two kinds of negotiation are orthogonal and thus may be used separately or in combination. </p>\n<h3>Server-driven Negotiation</h3>\n<p>If the selection of the best representation for a response is made by an algorithm located at the server, it is called server-driven negotiation.</p>\n<p>When a client sends an HTTP request, it may specify the media types that it can accept via an Accept header like this:</p>\n<div class=\"gatsby-highlight\" data-language=\"readme\"><pre class=\"language-readme\"><code class=\"language-readme\">Accept: text/xml, application/xml, application/json</code></pre></div>\n<p>A client may also include vendor-specific media types like</p>\n<div class=\"gatsby-highlight\" data-language=\"readme\"><pre class=\"language-readme\"><code class=\"language-readme\">application/vnd.ims.lis.v1.person+json\napplication/vnd.sif.v2.studentpersonal+json</code></pre></div>\n<p>If no Accept header is present, the server is free to deliver whatever representation it thinks is best.</p>\n<p> When an Accept header is present, the server can </p>\n<ol>\n<li>return one of the representations from the list directly in the HTTP response</li>\n<li>redirect to a different URL that contains one of the requested representations, or send a 415 error (Unsupported Media Type).</li>\n</ol>\n<p>HTTP/1.1 includes the following request-header fields for enabling server-driven negotiation through description of user agent capabilities and user preferences: <code class=\"language-text\">Accept</code>, <code class=\"language-text\">Accept-Charset</code>, <code class=\"language-text\">Accept-Encoding</code>, <code class=\"language-text\">Accept-Language</code>, and <code class=\"language-text\">User-Agent</code>.</p>\n<h4>Server-Driven negotiation has a number of disadvantages</h4>\n<p>It is impossible for the server to determine accurately what might be the \"best\" representation for any given client, especially if it does not receive an Accept header. </p>\n<h3>Agent-driven Negotiation</h3>\n<p>With agent driven negotiation, the client does not provide an Accept header. Instead, the client simply issues an HTTP request to the URL for an object.  If the server supports only one representation for the object, that representation is returned immediately.  Otherwise, the server returns a list of available representations in the response where each representation is identified by its own URI.  The client selects an appropriate representation and then issues a second HTTP request to one of the alternative URIs given in the response.</p>\n<p>The HTTP 1.1 specification does not prescribe a format for delivering the list of available representations. Fortunately, with RDF there is a widely accepted practice of identifying alternative representations of an object.</p>\n<p>Thus, a server that wishes to provide a list of alternate representations of an object could return a JSON-LD payload like the one shown below.</p>\n<div class=\"gatsby-highlight\" data-language=\"json-ld\"><pre class=\"language-json-ld\"><code class=\"language-json-ld\">{\n  &quot;@context&quot; : {\n    &quot;sameAs&quot; : &quot;http://www.w3.org/2002/07/owl#sameAs&quot;,\n    &quot;format&quot; : &quot;http://purl.org/dc/elements/1.1/format&quot;\n  },\n  &quot;@id&quot; : &quot;http://server.example.com/resources/Person/1b16b1c3-a713-44cd-9bb2-0a59bb1117de&quot;\n  &quot;sameAs&quot; : [\n    { &quot;@id&quot; : &quot;http://server.example.com/resources/Person/1b16b1c3-a713-44cd-9bb2-0a59bb1117de/ims&quot;,\n      &quot;format&quot; : &quot;application/vnd.ims.lis.v1.person&quot;\n    },\n    { &quot;@id&quot; : &quot;http://server.example.com/resources/Person/1b16b1c3-a713-44cd-9bb2-0a59bb1117de/sif&quot;,\n      &quot;format&quot; : &quot;application/vnd.sif.v2.studentpersonal&quot;\n    }\n  ]\n}</code></pre></div>\n<h3>Combining Server-Driven and Agent-Driven Negotiation</h3>\n<p>It is possible to combine Server-driven and Agent-driven negotiation.  In this case the client does not supply an Accept header.  The response from the server contains a default representation of the object, and that representation also includes the sameAs properties as illustrated in the example above.  Now, the client can use the default representation if it wishes, or it can retrieve a different representation of the object by following one of the sameAs relationships.</p>\n<h3>Server-driven Vs Agent-driven Content Negotiations</h3>\n<p>Practically, you will NOT find much usage of server side negotiations because in that way, you have to make lots of assumptions about client expectations. Few things like client context or how client will use the resource representation is almost impossible to determine. Apart from that this approach makes the server side code complex, unnecessarily.</p>\n<p>So, most REST API implementations rely on agent driven content negotiations. Agent driven content negotiation rely on usage of HTTP request headers or resource URI patterns.</p>\n<h4>Content negotiation using HTTP headers</h4>\n<p>At server side, an incoming request may have an entity attached to it. To determine it’s type, server uses the HTTP request header <code class=\"language-text\">Content-Type</code>.</p>\n<p>Some common examples of content types are “text/plain”, “application/xml”, “text/html”, “application/json”, “image/gif”, and “image/jpeg”.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">Content-Type: application/json</code></pre></div>\n<p>Similarly, to determine what type of representation is desired at client side, HTTP header ACCEPT is used.</p>\n<p>It will have one of the values as mentioned for Content-Type above.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">Accept: application/json</code></pre></div>\n<p>Generally, if no Accept header is present in the request, the server can send pre-configured default representation type.</p>\n<h4>Content negotiation using URL patterns</h4>\n<p>Another way to pass content type information to server, client may use specific extension in resource URIs.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">http://rest.api.com/v1/employees/20423.xml\nhttp://rest.api.com/v1/employees/20423.json</code></pre></div>\n<h4>Defining preferences</h4>\n<p>If is possible to have multiple values in Accept header. Client may want to give multiple values in accept header when client is not sure about if its desired representation is present or supported by server at that time.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">Accept: application/json,application/xml;q=0.9,*/*;q=0.8</code></pre></div>\n<p>Above Accept header allows you to ask the server a JSON format. If it can’t, perhaps it could return XML format (the second level). If it’s still not possible, let it return what it can.</p>\n<p>The preference order is defined through the q parameter with values from 0 to 1. When nothing is specified, the implicit value is 1.</p>\n<h3>Resources</h3>\n<p><a href=\"https://sites.google.com/site/restframework/content-negotiation\">Content Negotiation</a> - sites.google.com</p>\n<p><a href=\"https://restfulapi.net/content-negotiation/\">REST – Content Negotiation</a></p>\n<p><a href=\"http://restlet.com/company/blog/2015/12/10/understanding-http-content-negotiation/\">Understanding HTTP content negotiation</a></p>\n<p><a href=\"https://apigility.org/documentation/api-primer/content-negotiation\">Content Negotiation</a> - apigility.org</p>","frontmatter":{"date":"July 02, 2019","path":"content-negotiation","category":"frontend","title":"Content Negotiation"}}},"pageContext":{"location":"content-negotiation","category":"frontend"}}