{"data":{"markdownRemark":{"html":"<h3>Overview</h3>\n<p>HTTP is an application layer protocol designed within the framework of the Internet protocol suite, functions as a request–response protocol in the client–server computing model. Its definition presumes an underlying and reliable transport layer protocol,[6] and Transmission Control Protocol (TCP) is commonly used.</p>\n<p>HTTP resources are identified and located on the network by Uniform Resource Locators (URLs).</p>\n<p>HTTP/1.1 is a revision of the original HTTP (HTTP/1.0). In HTTP/1.0 a separate connection to the same server is made for every resource request. HTTP/1.1 can reuse a connection multiple times to download images, scripts, stylesheets, etc.</p>\n<h3>HTTP session</h3>\n<p>An HTTP session is a sequence of network request-response transactions. An HTTP client initiates a request by establishing a Transmission Control Protocol (TCP) connection to a particular port on a server. An HTTP server listening on that port waits for a client's request message. Upon receiving the request, the server sends back a status line, such as \"HTTP/1.1 200 OK\", and a message of its own.</p>\n<h4>Persistent connections</h4>\n<p>In HTTP/0.9 and 1.0, the connection is closed after a single request/response pair. In HTTP/1.1 a keep-alive-mechanism was introduced, where a connection could be reused for more than one request. Such persistent connections reduce request latency perceptibly, because the client does not need to re-negotiate the TCP 3-Way-Handshake connection after the first request has been sent</p>\n<h4>Session state</h4>\n<p>HTTP is a stateless protocol. A stateless protocol does not require the HTTP server to retain information or status about each user for the duration of multiple requests.</p>\n<p>But some web applications may have to track the user's progress from page to page, for example when a web server is required to customize the content of a web page for a user. Solutions for these cases include:</p>\n<ul>\n<li>the use of HTTP cookies.</li>\n<li>server side sessions.</li>\n<li>hidden variables (when the current page contains a form).</li>\n<li>URL-rewriting using URI-encoded parameters, e.g., /index.php?session<em>id=some</em>unique<em>session</em>code.</li>\n</ul>\n<h3>HTTP authentication</h3>\n<p>HTTP provides a general framework for access control and authentication, via an extensible set of challenge-response authentication schemes, which can be used by a server to challenge a client request and by a client to provide authentication information.</p>\n<h4>Authentication</h4>\n<p>Authentication is a way to identify yourself to the Web server. You need to show proof that you have the right to access the requested resources. Usually, this is done by using a combination of username and password.</p>\n<h5>Challenge/Response Authentication Framework</h5>\n<p>It means that when someone sends a request, instead of responding to it immediately, the server sends authentication challenge. It challenges the user to provide the proof of identity by entering the secret information.</p>\n<h5>Authentication Related request/response headers</h5>\n<p>The server issues the challenge by utilizing the WWW-Authenticate response header. It contains the information about the authentication protocol and the security realm.</p>\n<p>After the client inputs the credentials, the request is sent again. This time with the Authorization header containing the authentication algorithm and the username/password combination. If the credentials are correct, the server returns the response and additional info in an optional Authentication-Info response header.</p>\n<h5>Security Realms</h5>\n<p>Security realms provide the way to associate different access right to different resource groups on the server. These are called protection spaces.</p>\n<p>The server can have multiple realms. For example, one would be for website statistics information that only website admins can access. Another would be for website images that other users can access and upload images to.</p>\n<h4>Basic access authentication</h4>\n<p>Basic authentication packs the username and password into one string and separates them using the colon (:). After that, it encodes them using the Base64 encoding.</p>\n<ol>\n<li>The user requests access to some image on the server.</li>\n</ol>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">GET /gallery/personal/images/image1.jpg HTTP/1.1\nHost: www.somedomain.com</code></pre></div>\n<ol start=\"2\">\n<li>The server sends the authentication challenge to the user.</li>\n</ol>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">HTTP/1.1 401 Access Denied\nWWW-Authenticate: Basic realm=&quot;gallery&quot;</code></pre></div>\n<ol start=\"3\">\n<li>The user identifies itself via form input.</li>\n</ol>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">GET /gallery/personal/images/image1.jpg HTTP/1.1\nAuthorization: Basic Zm9vOmJhcg==</code></pre></div>\n<ol start=\"4\">\n<li>The server checks the credentials and sends the 200 OK status code and the image data.</li>\n</ol>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">HTTP/1.1 200 OK\nContent-type: image/jpeg\n...&lt;image data&gt;</code></pre></div>\n<p>There is also no protection against proxies or any other type of attack that changes the request body and leaves the request headers intact.</p>\n<p>So, as you can see, Basic authentication is less than perfect authentication mechanism. To make it more secure and usable, Basic authentication can be implemented by using HTTPS over SSL</p>\n<h4>Digest access authentication</h4>\n<p>Digest authentication is a more secure and reliable alternative to simple but insecure Basic authentication.</p>\n<p>Digest authentication uses MD5 cryptographic hashing combined with the usage of nonces.</p>\n<ol>\n<li>The client sends an unauthenticated request.</li>\n</ol>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">GET /dir/index.html HTTP/1.0\nHost: localhost</code></pre></div>\n<ol start=\"2\">\n<li>The server challenges the client to authenticate using the Digest authentication and sends the required information to the client.</li>\n</ol>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">HTTP/1.0 401 Unauthorized\nWWW-Authenticate: Digest realm=&quot;shire@middleearth.com&quot;,\n                        qop=&quot;auth,auth-int&quot;,\n                        nonce=&quot;cmFuZG9tbHlnZW5lcmF0ZWRub25jZQ&quot;,\n                        opaque=&quot;c29tZXJhbmRvbW9wYXF1ZXN0cmluZw&quot;\nContent-Type: text/html\nContent-Length: 153\n\n&lt;!DOCTYPE html&gt;\n&lt;html&gt;\n  &lt;head&gt;\n    &lt;meta charset=&quot;UTF-8&quot; /&gt;\n    &lt;title&gt;Error&lt;/title&gt;\n  &lt;/head&gt;\n  &lt;body&gt;\n    &lt;h1&gt;401 Unauthorized.&lt;/h1&gt;\n  &lt;/body&gt;\n&lt;/html&gt;</code></pre></div>\n<ol start=\"3\">\n<li>The client calculates the response value and sends it together with username, realm, URI, nonce, opaque, qop, nc and cnonce. A lot of stuff.</li>\n</ol>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">GET /dir/index.html HTTP/1.0\nHost: localhost\nAuthorization: Digest username=&quot;Gandalf&quot;,\n                     realm=&quot;shire@middleearth.com&quot;,\n                     nonce=&quot;cmFuZG9tbHlnZW5lcmF0ZWRub25jZQ&quot;,\n                     uri=&quot;/dir/index.html&quot;,\n                     qop=auth,\n                     nc=00000001,\n                     cnonce=&quot;0a4f113b&quot;,\n                     response=&quot;5a1c3bb349cf6986abf985257d968d86&quot;,\n                     opaque=&quot;c29tZXJhbmRvbW9wYXF1ZXN0cmluZw&quot;</code></pre></div>\n<ol start=\"4\">\n<li>The server computes the hash on its own and compares the two. If they match it serves the client with the requested data.</li>\n</ol>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">HTTP/1.0 200 OK\nContent-Type: text/html\nContent-Length: 2345\n\n... &lt;content data&gt;</code></pre></div>\n<p>nonce and opaque, the server defined strings that client returns upon recieving them.</p>\n<p>qop, one or more of the predefined values (“auth” | “auth-int” | token) which affect the computation of the digest.</p>\n<p>cnonce, client nonce, must be generated if qop is set.</p>\n<p>nc, nonce count, must be sent if qop is set. If the same nc value appears twice, then the request is a replay.</p>\n<p>The response attribute is calculated in the following way:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">HA1 = MD5(&quot;Gandalf:shire@middleearth.com:Lord Of The Rings&quot;)\n       = 681028410e804a5b60f69e894701d4b4\n \nHA2 = MD5(&quot;GET:/dir/index.html&quot;)\n       = 39aff3a2bab6126f332b942af96d3366\n \nResponse = MD5( &quot;681028410e804a5b60f69e894701d4b4:\n                 cmFuZG9tbHlnZW5lcmF0ZWRub25jZQ:\n                 00000001:0a4f113b:auth:\n                 39aff3a2bab6126f332b942af96d3366&quot; )\n         = 5a1c3bb349cf6986abf985257d968d86</code></pre></div>\n<p><strong>Link:</strong> (Authentication Mechanisms)[https://code-maze.com/http-series-part-4/]</p>\n<h3>Message format</h3>\n<h4>Request message</h4>\n<p>The request message consists of the following:</p>\n<ol>\n<li>a request line e.g. GET /images/logo.png HTTP/1.1</li>\n<li>request header fields</li>\n<li>an empty line</li>\n<li>an optional message body</li>\n</ol>\n<p>The request line and other header fields must each end with <CR><LF>. The empty line must consist of only <CR><LF> and no other whitespace. And all header fields except Host are optional.</p>\n<h5>Request methods</h5>\n<p>The HTTP/1.0 specification defined the GET, HEAD and POST methods and the HTTP/1.1 specification added five new methods: OPTIONS, PUT, DELETE, TRACE and CONNECT. Any client can use any method and the server can be configured to support any combination of methods.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">Method names are case sensitive</code></pre></div>\n<p><strong>GET</strong></p>\n<p>The GET method requests a representation of the specified resource. Requests using GET should only retrieve data and should have no other effect.</p>\n<p><strong>HEAD</strong></p>\n<p>The HEAD method asks for a response identical to that of a GET request, but without the response body. This is useful for <strong>retrieving meta-information</strong> written in response headers, without having to transport the entire content.</p>\n<p><strong>POST</strong></p>\n<p>The POST method requests that the server accept the entity enclosed in the request as a new subordinate of the web resource identified by the URI.</p>\n<p><strong>PUT</strong></p>\n<p>The PUT method requests that the enclosed entity be stored under the supplied URI. If the URI refers to an already existing resource, it is modified; if the URI does not point to an existing resource, then the server can create the resource with that URI.</p>\n<p><strong>DELETE</strong></p>\n<p>The DELETE method deletes the specified resource.</p>\n<p><strong>TRACE</strong></p>\n<p>The TRACE method echoes the received request so that a client can see what (if any) changes or additions have been made by intermediate servers.</p>\n<p><strong>OPTIONS</strong></p>\n<p>The OPTIONS method returns the HTTP methods that the server supports for the specified URL. This can be used to check the functionality of a web server by requesting '*' instead of a specific resource.</p>\n<p><strong>CONNECT</strong></p>\n<p>The CONNECT method converts the request connection to a transparent TCP/IP tunnel, usually to facilitate SSL-encrypted communication (HTTPS) through an unencrypted HTTP proxy.</p>\n<p><strong>PATCH</strong></p>\n<p>The PATCH method applies partial modifications to a resource.</p>\n<p>All general-purpose HTTP servers are required to implement at least the GET and HEAD methods, and all other methods are considered optional by the specification.</p>\n<h5>Safe methods</h5>\n<p>Some of the methods (for example, GET, HEAD, OPTIONS and TRACE) are, by convention, defined as safe, which means they are intended only for information retrieval and should not change the state of the server.</p>\n<p>By contrast, methods such as POST, PUT, DELETE and PATCH are intended for actions that may cause side effects either on the server, or external side effects such as financial transactions or transmission of email.</p>\n<h5>Idempotent methods and web applications</h5>\n<p>Methods PUT and DELETE are defined to be idempotent, meaning that multiple identical requests should have the same effect as a single request.\nMethods GET, HEAD, OPTIONS and TRACE, being prescribed as safe, should also be idempotent.</p>\n<p>In contrast, the POST method is not necessarily idempotent, and therefore sending an identical POST request multiple times may further affect state or cause further side effects</p>\n<h5>Reponse message</h5>\n<p>The response message consists of the following:</p>\n<ol>\n<li>a status line which includes the status code and reason message e.g., HTTP/1.1 200 OK</li>\n<li>response header fields (e.g., Content-Type: text/html)</li>\n<li>an empty line</li>\n<li>an optional message body</li>\n</ol>\n<p>The status line and other header fields must all end with <CR><LF>. The empty line must consist of only <CR><LF> and no other whitespace. This strict requirement for <CR><LF> is relaxed somewhat within message bodies for consistent use of other system linebreaks such as <CR> or <LF> alone.</p>\n<h5>Status codes</h5>\n<p>If the status code indicated a problem, the user agent might display the reason phrase to the user to provide further information about the nature of the problem.</p>\n<p>HTTP status code is primarily divided into five groups for better explanation of request and responses between client and server as named:</p>\n<ol>\n<li>Informational 1XX</li>\n<li>Successful 2XX</li>\n<li>Redirection 3XX</li>\n<li>Client Error 4XX</li>\n<li>Server Error 5XX</li>\n</ol>\n<h3>Encrypted connections</h3>\n<p>The most popular way of establishing an encrypted HTTP connection is HTTPS. Two other methods for establishing an encrypted HTTP connection also exist: Secure Hypertext Transfer Protocol, and using the HTTP/1.1 Upgrade header to specify an upgrade to TLS.</p>\n<h3>Example session</h3>\n<h4>Client request</h4>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">GET / HTTP/1.1\nHost: www.example.com</code></pre></div>\n<h4>Server response</h4>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">HTTP/1.1 200 OK\nDate: Mon, 23 May 2005 22:38:34 GMT\nContent-Type: text/html; charset=UTF-8\nContent-Length: 138\nLast-Modified: Wed, 08 Jan 2003 23:11:55 GMT\nServer: Apache/1.3.3.7 (Unix) (Red-Hat/Linux)\nETag: &quot;3f80f-1b6-3e1cb03b&quot;\nAccept-Ranges: bytes\nConnection: close\n\n&lt;html&gt;\n  &lt;head&gt;\n    &lt;title&gt;An Example Page&lt;/title&gt;\n  &lt;/head&gt;\n  &lt;body&gt;\n    &lt;p&gt;Hello World, this is a very simple HTML document.&lt;/p&gt;\n  &lt;/body&gt;\n&lt;/html&gt;</code></pre></div>\n<h3>Security</h3>\n<h4>HTTPS</h4>\n<p>HTTPS stands for Hypertext Transfer Protocol Secure which means that client and server communicate through HTTP but over the secure SSL/TLS connection.</p>\n<p>HTTPS solves the MITM attacks problem by encrypting the communication.</p>\n<h5>SSL &#x26; TLS</h5>\n<p>Terms SSL (Secure Socket Layer) and TLS (Transport Layer Security) are used interchangeably, but in fact, today, when someone mentions SSL they probably mean TLS.</p>\n<h5>TLS handshake</h5>\n<p>There is an initial handshake between the client and the server, in which they exchange keys and certificates. After that handshake, encrypted communication is ready to start.</p>\n<p><img src=\"https://code-maze.com/wp-content/uploads/2017/07/TLS-handshake.png\" alt=\"https handshake\"></p>\n<h5>Certificate and Certification Authorities (CAs)</h5>\n<p>Certificate and Certification Authorities (CAs)\nCertificates are the crucial part of the secure communication over HTTPS. They are issued by one of the trusted Certification Authorities.</p>\n<p>A digital certificate allows the users of the website to communicate in the secure fashion when using a website.</p>","frontmatter":{"date":"May 17, 2019","path":"http","category":"frontend","title":"Hypertext Transfer Protocol"}}},"pageContext":{"location":"http","category":"frontend"}}