{"data":{"markdownRemark":{"html":"<p>One of the central tenets of REST is that a given object can have multiple representations.  For human consumption, an object might be rendered as HTML, PDF, video, etc.  For machine consumption, an object might be rendered as XML or JSON.  Indeed, within those broad categories, an object might have many different representations.</p>\n<p>There are two kinds of content negotiation which are possible in HTTP: <strong>server-driven</strong> and <strong>agent-driven negotiation</strong>. These two kinds of negotiation are orthogonal and thus may be used separately or in combination. </p>\n<h3>Server-driven Negotiation</h3>\n<p>If the selection of the best representation for a response is made by an algorithm located at the server, it is called server-driven negotiation.</p>\n<p>When a client sends an HTTP request, it may specify the media types that it can accept via an Accept header like this:</p>\n<div class=\"gatsby-highlight\" data-language=\"readme\"><pre class=\"language-readme\"><code class=\"language-readme\">Accept: text/xml, application/xml, application/json</code></pre></div>\n<p>A client may also include vendor-specific media types like</p>\n<div class=\"gatsby-highlight\" data-language=\"readme\"><pre class=\"language-readme\"><code class=\"language-readme\">application/vnd.ims.lis.v1.person+json\napplication/vnd.sif.v2.studentpersonal+json</code></pre></div>\n<p>If no Accept header is present, the server is free to deliver whatever representation it thinks is best.</p>\n<p> When an Accept header is present, the server can </p>\n<ol>\n<li>return one of the representations from the list directly in the HTTP response</li>\n<li>redirect to a different URL that contains one of the requested representations, or send a 415 error (Unsupported Media Type).</li>\n</ol>\n<p>HTTP/1.1 includes the following request-header fields for enabling server-driven negotiation through description of user agent capabilities and user preferences: <code class=\"language-text\">Accept</code>, <code class=\"language-text\">Accept-Charset</code>, <code class=\"language-text\">Accept-Encoding</code>, <code class=\"language-text\">Accept-Language</code>, and <code class=\"language-text\">User-Agent</code>.</p>\n<h3>Agent-driven Negotiation</h3>\n<p>With agent-driven negotiation, selection of the best representation for a response is performed by the user agent after receiving an initial response from the origin server.</p>\n<p>HTTP/1.1 defines the <code class=\"language-text\">300</code> and <code class=\"language-text\">406</code> status codes for enabling agent-driven negotiation when the server is unwilling or unable to provide a varying response using server-driven negotiation.</p>\n<h3>Transparent Negotiation</h3>\n<p>Transparent negotiation is a combination of both server-driven and agent-driven negotiation. When a cache is supplied with a form of the list of available representations of the response and the dimensions of variance are completely understood by the cache, then the cache becomes capable of performing server- driven negotiation on behalf of the origin server for subsequent requests on that resource.</p>","frontmatter":{"date":"July 01, 2019","path":"xss","category":"frontend","title":"XSS"}}},"pageContext":{"location":"xss","category":"frontend"}}